In [39]:
import pandas as pd
df = pd.read_excel(r"C:\Users\Megh.Chakravarty\Desktop\studentData.xlsx",header=1)
df

      Name  Age Gender School
0     megh   19      m    DPS
1  abhinav   20      m    DPS
2  devarsh   21      m    DPS
3  rajveer   18      m  TULIP
4    daksh   19      m  TULIP
5    saket   20      m    NaN
6   chirag   20      m    ANT

In [40]:
df.head()
df.tail(3)
df[2:5]

      Name  Age Gender School
2  devarsh   21      m    DPS
3  rajveer   18      m  TULIP
4    daksh   19      m  TULIP

In [ ]:
df['Age'].max()

np.int64(21)

In [44]:
df.dropna(inplace=True)
df

      Name  Age Gender School
0     megh   19      m    DPS
1  abhinav   20      m    DPS
2  devarsh   21      m    DPS
3  rajveer   18      m  TULIP
4    daksh   19      m  TULIP
6   chirag   20      m    ANT

In [51]:
grp = df.groupby('School')
grp
for city, city_df in grp:
    print(city)
    print(city_df)

ANT
     Name  Age Gender School
6  chirag   20      m    ANT
DPS
      Name  Age Gender School
0     megh   19      m    DPS
1  abhinav   20      m    DPS
2  devarsh   21      m    DPS
TULIP
      Name  Age Gender School
3  rajveer   18      m  TULIP
4    daksh   19      m  TULIP

In [53]:
grp.get_group('DPS')

      Name  Age Gender School
0     megh   19      m    DPS
1  abhinav   20      m    DPS
2  devarsh   21      m    DPS

In [57]:
grp.max()

           Name  Age Gender
School
ANT      chirag   20      m
DPS        megh   21      m
TULIP   rajveer   19      m

In [ ]:
%matplotlib inline
grp.plot()